card_number = int(input("لطفا 6 رقم اول کارت را وارد کنید:"))
if len(str(card_number)) != 6:
    raise ValueError("طول شماره کارت وارد شده باید 6 رقم باشد")
banks = {
    627412: "بانک اقتصاد نوین",
    207177: "بانک توسعه صادرات ایران",
    627381: "بانک انصار",
    502229: "بانک پاسارگاد ",
    505785: "بانک ایران زمین",
    502806: "بانک شهر",
    622106: " بانک پارسیان",
    502908: " بانک توسعه تعاون",
    639194: " بانک پارسیان",
    502910: "بانک کارآفرین",
    627884: "بانک پارسیان",
    502938: " بانک دی",
    639347: "بانک پاسارگار",
    505416: "بانک گردشگری",
    636214: "  بانک تات",
    505801: " موسسه اعتباری کوثر",
    627353: "  بانک تجارت",
    589210: "بانک سپه",
    589463: "بانک رفاه کارگران",
    627648: " بانک توسعه صادرات ایران",
    603769: "بانک صادرات ایران",
    603770: "بانک کشاورزی",
    636949: "بانک حکمت ایرانیان",
    603799: "بانک ملی ایران",
    606373: " بانک قرض الحسنه مهر ایران",
    610433: " بانک ملت",
    621986: "بانک سامان",
    639346: "بانک سینا",
    627488: " بانک کارآفرین",
    627961: "بانک صنعت و معدن",
    639217: "بانک کشاورزی",
    636795: " بانک مرکزی",
    628023: " بانک مسکن",
    639370: " بانک مهر اقتصاد",
    627760: " پست بانک ایران",
    639599: "بانک قوامین",
    628157: " وسسه اعتباری توسعه",
    639607: "بانک سرمایه",
    991975: "بانک ملت"
}

for j, k in banks.items():
    if card_number == j:
        print(k)

name = "mamad"
